In [83]:
import pandas as pd

In [84]:
import numpy as np

In [85]:
import warnings

In [86]:
warnings.filterwarnings('ignore')

In [87]:
book=pd.read_csv(r'C:\Users\deyar\OneDrive\Desktop\BookRecommendationSystem\notebooks\data\Books.csv')
user=pd.read_csv(r'C:\Users\deyar\OneDrive\Desktop\BookRecommendationSystem\notebooks\data\Users.csv')
rating=pd.read_csv(r'C:\Users\deyar\OneDrive\Desktop\BookRecommendationSystem\notebooks\data\Ratings.csv')

In [88]:
book.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [89]:
user.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [90]:
rating.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [91]:
book_and_rating=book.merge(rating,on='ISBN')

In [92]:
book_and_rating.shape

(1031136, 10)

In [93]:
book_and_rating.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L,User-ID,Book-Rating
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,2,0
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,8,5

In [94]:
book_and_rating.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            2
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            4
User-ID                0
Book-Rating            0
dtype: int64

In [95]:
book_and_rating.duplicated().sum()

0

In [96]:
book_and_rating.dropna(inplace=True)

In [97]:
book_and_rating.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            0
Year-Of-Publication    0
Publisher              0
Image-URL-S            0
Image-URL-M            0
Image-URL-L            0
User-ID                0
Book-Rating            0
dtype: int64

In [98]:
book_and_rating.shape

(1031128, 10)

In [99]:
book_and_rating.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L', 'User-ID', 'Book-Rating'],
      dtype='object')

In [100]:
count=book_and_rating.groupby('Book-Title')['Book-Rating'].count().reset_index()

In [101]:
count.columns

Index(['Book-Title', 'Book-Rating'], dtype='object')

In [102]:
count=count.rename(columns={'Book-Rating':'rating_count'})

In [103]:
count.head(2)

                                          Book-Title  rating_count
0   A Light in the Storm: The Civil War Diary of ...             4
1                              Always Have Popsicles             1

In [104]:
avg=book_and_rating.groupby('Book-Title')['Book-Rating'].mean().reset_index()

In [105]:
avg.head()

                                          Book-Title  Book-Rating
0   A Light in the Storm: The Civil War Diary of ...         2.25
1                              Always Have Popsicles         0.00
2               Apple Magic (The Collector's series)         0.00
3   Ask Lily (Young Women of Faith: Lily Series, ...         8.00
4   Beyond IBM: Leadership Marketing and Finance ...         0.00

In [106]:
avg=avg.rename(columns={'Book-Rating':'rating_avg'})
avg.head(2)

                                          Book-Title  rating_avg
0   A Light in the Storm: The Civil War Diary of ...        2.25
1                              Always Have Popsicles        0.00

In [107]:
count.head(2)

                                          Book-Title  rating_count
0   A Light in the Storm: The Civil War Diary of ...             4
1                              Always Have Popsicles             1

In [108]:
count_avg=count.merge(avg,on='Book-Title')

In [109]:
count_avg.head()

                                          Book-Title  rating_count  rating_avg
0   A Light in the Storm: The Civil War Diary of ...             4        2.25
1                              Always Have Popsicles             1        0.00
2               Apple Magic (The Collector's series)             1        0.00
3   Ask Lily (Young Women of Faith: Lily Series, ...             1        8.00
4   Beyond IBM: Leadership Marketing and Finance ...             1        0.00

In [110]:
popular_book=count_avg[count_avg['rating_count']>250]

In [111]:
popular_book.head(2)

              Book-Title  rating_count  rating_avg
764                 1984           284    4.454225
818  1st to Die: A Novel           509    3.575639

In [112]:
popular_book.shape

(186, 3)

In [113]:
popular_book=popular_book.sort_values(by='rating_count',ascending=False).head(50)

In [114]:
popular_book.shape

(50, 3)

In [115]:
popular_book.head()

                        Book-Title  rating_count  rating_avg
234945                 Wild Animus          2502    1.019584
196321   The Lovely Bones: A Novel          1295    4.468726
183568           The Da Vinci Code           898    4.642539
5303               A Painted House           838    3.231504
199232  The Nanny Diaries: A Novel           828    3.530193

In [116]:
book.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [117]:
popular_book50=popular_book.merge(book,on='Book-Title')

In [118]:
popular_book50.shape

(216, 10)

In [119]:
final50=popular_book50.drop_duplicates('Book-Title')

In [120]:
final50.head()

,Book-Title,rating_count,rating_avg,ISBN,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,Wild Animus,2502,1.019584,0971880107,Rich Shapero,2004,Too Far,http://images.amazon.com/images/P/0971880107.0...,http://images.amazon.com/images/P/0971880107.0...,http://images.amazon.com/images/P/0971880107.0...
1,The Lovely Bones: A Novel,1295,4.468726,0316666343,Alice Sebold,2002,"Little, Brown",http://images.amazon.com/images/P/0316666343.0...,http://images.amazon.com/images/P/0316666343.0...,http://images.amazon.com/images/P/0316666343.0...
2,The Da Vinci Code,898,4.642539,0385504209,Dan Brown,2003,Doubleday,http://images.amazon.com/images/P/0385504209.0...,http://images.amazon.com/images/P/0385504209.0...,http://images.amazon.com/images/P/0385504209.0...
8,A Painted House,838,3.231504,044023722X,John Grisham,2001,Dell Publishing Company,http://images.amazon.com/images/P/044023722X.0...,http://images.amazon.com/images/P/044023722X.0...,http://images.amazon.com/images/P/044023722X.0...
13,The Nanny Diaries: A Novel,828,3.530193,0312278586,Emma McLaughlin,2002,St. Martin's Press,http://images.amazon.com/images/P/0312278586.0...,http://images.amazon.com/images/P/0312278586.0...,http://images.amazon.com/images/P/0312278586.0...

In [121]:
final50.shape

(50, 10)

In [122]:
final50.columns

Index(['Book-Title', 'rating_count', 'rating_avg', 'ISBN', 'Book-Author',
       'Year-Of-Publication', 'Publisher', 'Image-URL-S', 'Image-URL-M',
       'Image-URL-L'],
      dtype='object')

In [123]:
final50=final50[['Book-Title','Image-URL-M','Book-Author','rating_count','rating_avg']]
final50.head(3)

,Book-Title,Image-URL-M,Book-Author,rating_count,rating_avg
0,Wild Animus,http://images.amazon.com/images/P/0971880107.0...,Rich Shapero,2502,1.019584
1,The Lovely Bones: A Novel,http://images.amazon.com/images/P/0316666343.0...,Alice Sebold,1295,4.468726
2,The Da Vinci Code,http://images.amazon.com/images/P/0385504209.0...,Dan Brown,898,4.642539